GREETING_TEXT: str = '''
Привет 👋 
Я бот-помошник 5 общежития. Тебя ещё нет в моей базе, давай познакомимся!

Введи своё полное имя в формате "Фамилия Имя Отчество". 
Постарайся не допускать ошибок, от этого зависят уведомления об оплате. 
'''

# Buttons text
REGISTER_BUTTON_TEXT: str = "Зарегистрироваться"
KOMENDANT_BUTTON_TEXT: str = "Коментдант"
KASTELANSHA_BUTTON_TEXT: str = "Кастелянша"
SHOWER_BUTTON_TEXT: str = "Душ"
LAUNDARY_BUTTON_TEXT: str = "Постирочная"
GUESTS_BUTTON_TEXT: str = "Гости"
QUESTION_BUTTON_TEXT: str = "Задать вопрос"
GYM_BUTTON_TEXT: str = "Спортзал"
STUDY_ROOM_BUTTON_TEXT: str = "Учебная комната"
STUDSOVET_BUTTON_TEXT: str = "Студсовет"
PAYMENT_BUTTON_TEXT: str = "Оплата"

MAIN_MENU_BUTTON_TEXT: str = "В главное меню"

MAIN_MENU_TEXT: str = "Главное меню"
INFO_TEXT: str = "Информация"

# Infos
KOMENDANT_INFO_TEXT: str = """
Милена Леонидовна работает в 121 кабинете корпуса Б

График работы:
Понедельник - Четверг с 9:00 до 17:00.
Пятница с 9:00 до 16:30.

Обеденный перерыв с 13:00 до 13:30.

График работы в праздничные дни может измениться.

Телефон: +78127750530 доб. 1454.
Почта: dorm5@spbstu.ru"""

KASTELANSHA_INFO_TEXT: str = """
Смена белья производится в корпусе Б в 102 кабинете.

Маргарита Валерьевна (кастелянша) меняет белье со вторника по четверг, с 9:00 до 16:30, в пятницу с 9:00 до 15:30.

Обеденный перерыв с 13:00 до 13:30.

Белье приносить СТРОГО в пакетах.

Возможны изменения, актуальная информация размещена на первом этаже."""

SHOWER_INFO_TEXT: str = """
Душ работает c 6:00 до 12:00 и с 18:00 до 01:00 в среду.

В остальные дни c 6:00 до 12:00 и с 15:00 до 01:00.

Перерывы нужны для проветривания и уборки."""

LAUNDARY_INFO_TEXT: str = "НЕТ ТЕКСТА"

GUESTS_INFO_TEXT: str = """
🔥 ГОСТИ В ОБЩЕЖИТИИ

📖 Для посещения гостю потребуется предъявить паспорт

⏳ Время входа:
Будни: с 14:00 до 22:00
Выходные: с 10:00 до 22:00
⏳ Пребывание до 23:00

❗Гостей обязательно нужно встретить"""

GYM_INFO_TEXT: str = "НЕТ ТЕКСТА"

STUDY_ROOM_INFO_TEXT: str = "НЕТ ТЕКСТА"

STUDSOVET_INFO_TEXT: str = """
В нашем общежитии есть студенческий совет!
В его состав входят активные и ответственные ребята, а так же старосты этажей.

1 этаж (112): https://vk.com/eva_pshenichnaya
2 этаж (203): https://vk.com/shendrikovas
3 этаж (309): https://vk.com/olivesouuul
4 этаж (401): https://vk.com/vchernovaa
5 этаж (508): https://vk.com/iauzhenesprinter

Цель деятельности студенческого совета – создание условий для реализации интересов, прав, творческого потенциала студентов, социально и культурно значимых инициатив, развитие студенческого самоуправления.

Если у тебя есть вопросы, то пиши своим старостам этажа или председателю (https://vk.com/dan9_rezzya) или её заместителю (https://vk.com/carefulbitch228)"""
