import payment_functions

GREETING_TEXT: str = '''
Привет 👋 
Я бот-помошник 5 общежития. Тебя ещё нет в моей базе, давай познакомимся!

Введи своё полное имя в формате "Фамилия Имя Отчество". 
Постарайся не допускать ошибок, от этого зависят уведомления об оплате. 
'''

# Buttons text
KOMENDANT_BUTTON_TEXT: str = "Комендант"
KASTELANSHA_BUTTON_TEXT: str = "Кастелянша"
SHOWER_BUTTON_TEXT: str = "Душ"
LAUNDARY_BUTTON_TEXT: str = "Постирочная"
GUESTS_BUTTON_TEXT: str = "Гости"
QUESTION_BUTTON_TEXT: str = "Задать вопрос"
GYM_BUTTON_TEXT: str = "Спортзал"
STUDY_ROOM_BUTTON_TEXT: str = "Учебная комната"
STUDSOVET_BUTTON_TEXT: str = "Студсовет"
PAYMENT_BUTTON_TEXT: str = "Оплата за общежитие"
MANSARDA_BUTTON_TEXT: str = "Мансарда"

PROFILE_BUTTON_TEXT: str = "Мой профиль"
CHANGE_NAME_BUTTON_TEXT: str = "Изменить ФИО"
CHANGE_ROOM_BUTTON_TEXT: str = "Изменить № комнаты"
CHANGE_CORPUS_BUTTON_TEXT: str = "Изменить корпус"

SEND_CHECK_BUTTON_TEXT: str = "Прикрепить чек"

MAIN_MENU_BUTTON_TEXT: str = "В главное меню"

MAIN_MENU_TEXT: str = "Главное меню"
INFO_TEXT: str = "Информация"

# Infos
KOMENDANT_INFO_TEXT: str = """
Милена Леонидовна работает в 121 кабинете корпуса Б

График работы:
Понедельник - Четверг с 9:00 до 17:00.
Пятница с 9:00 до 16:30.

Обеденный перерыв с 13:00 до 13:30.

График работы в праздничные дни может измениться.

Телефон: +78127750530 доб. 1454.
Почта: dorm5@spbstu.ru"""

KASTELANSHA_INFO_TEXT: str = """
Смена белья производится в корпусе Б в 102 кабинете.

Маргарита Валерьевна (кастелянша) меняет белье со вторника по четверг, с 9:00 до 16:30, в пятницу с 9:00 до 15:30.

Обеденный перерыв с 13:00 до 13:30.

Белье приносить СТРОГО в пакетах.

Возможны изменения, актуальная информация размещена на первом этаже."""

SHOWER_INFO_TEXT: str = """
Душ работает c 6:00 до 12:00 и с 18:00 до 01:00 в среду.

В остальные дни c 6:00 до 12:00 и с 15:00 до 01:00.

Перерывы нужны для проветривания и уборки."""

LAUNDARY_INFO_TEXT: str = "НЕТ ТЕКСТА"

GUESTS_INFO_TEXT: str = """
🔥 ГОСТИ В ОБЩЕЖИТИИ

📖 Для посещения гостю потребуется предъявить паспорт

⏳ Время входа:
Будни: с 14:00 до 22:00
Выходные: с 10:00 до 22:00
⏳ Пребывание до 23:00

❗Гостей обязательно нужно встретить"""

GYM_INFO_TEXT: str = "НЕТ ТЕКСТА"

STUDY_ROOM_INFO_TEXT: str = "НЕТ ТЕКСТА"

STUDSOVET_INFO_A_TEXT: str = """
В нашем общежитии есть студенческий совет!
В его состав входят активные и ответственные ребята, в частности старосты этажей👇

1 этаж (112): https://vk.com/eva_pshenichnaya
2 этаж (203): https://vk.com/shendrikovas
3 этаж (309): https://vk.com/olivesouuul
4 этаж (401): https://vk.com/vchernovaa
5 этаж (517): https://vk.com/yashper1ca

Цель деятельности студенческого совета – создание условий для реализации интересов, прав, творческого потенциала студентов, социально и культурно значимых инициатив, развитие студенческого самоуправления.

Если у тебя есть вопросы, то пиши своим старостам этажа или председателю (https://vk.com/dan9_rezzya) или его заместителю (https://vk.com/carefulbitch228)
"""

STUDSOVET_INFO_B_TEXT: str = """
В нашем общежитии есть студенческий совет!
В его состав входят активные и ответственные ребята, в частности старосты этажей👇

2 этаж (222): https://vk.com/sadikta
3 этаж (310): https://vk.com/alexandr_kut
4 этаж (423): https://vk.com/compozallo
5 этаж (526): https://vk.com/mutsad

Цель деятельности студенческого совета – создание условий для реализации интересов, прав, творческого потенциала студентов, социально и культурно значимых инициатив, развитие студенческого самоуправления.

Если у тебя есть вопросы, то пиши своим старостам этажа или председателю (https://vk.com/dan9_rezzya) или его заместителю (https://vk.com/carefulbitch228)
"""

MANSARDA_INFO_TEXT: str = "НЕТ ТЕКСТА"

CORPUS_CHANGED_TEXT: str = "Корпус изменён!"

ENTER_FULL_NAME_TEXT: str = """Введи своё полное имя в формате "Фамилия Имя Отчество". 
Постарайся не допускать ошибок, от этого зависят уведомления об оплате. """

FULL_NAME_CHANGED_TEXT: str = "ФИО изменено!"

ENTER_ROOM_NUMBER_TEXT: str = """Введи номер своей комнаты:"""

ROOM_NUMBER_CHANGED_TEXT: str = "Номер комнаты изменён!"

SEND_CHECK_TEXT: str = "Отправь мне чек файлом. Если передумаешь, введи команду /cancel"

CANCEL_TEXT: str = "Че закибербуллили тебя, да? Ну ничего, попробуешь в другой раз"

UNKNOWN_TEXT: str = "Не понял... Я жду от тебя файл с чеком. Если передумаешь, введи команду /cancel"

INCORRECT_FILE_TEXT: str = "Не могу принять такой файл, попробуй по другому"
